Revit 2027 API
BuiltInFailures.TrussFailures.TrussIsAttachedTo Property
 Revit cannot attach to the chosen Roof/Slab. The truss cannot project to a surface or the attachment creates an invalid profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TrussIsAttachedTo { get; }
Public Shared ReadOnly Property TrussIsAttachedTo As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TrussIsAttachedTo {
	FailureDefinitionId^ get ();
}
static member TrussIsAttachedTo : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.TrussFailures Class
Autodesk.Revit.DB Namespace